#Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.

n = None

while n != 0:
    n = int(input('Введите день недели: '))

    if n == 6 or n==7:
        print("Сегодня выходной!!")
    elif n < 6:
        print("Сегодня будний день!!")
    else: print("Такого дня нет!!")


#Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

X = int(input('Введите число '))
Y = int(input('Введите число '))
Z = int(input('Введите число '))

bool1 =  not (X or Y or Z)
bool2 = not X and not Y and not Z

print(bool1 == bool2)

# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
# и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

x = int(input('Введите число '))
y = int(input('Введите число '))

if x>0 and y>0:
    print("Точка находится в первой четверти")
elif x< 0 and y>0:
    print("Точка находится в второй четверти")
elif x < 0 and y < 0:
    print("Точка находится в третьей четверти")
elif x > 0 and y < 0:
    print("Точка находится в четвертой четверти")

else: print("Введите другие значения, отличные от нуля")


# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).


n = int(input('Введите число '))

if n==1:
    print("Координаты x (0,infinity) , y (0, infinity)")
elif n == 2:
    print("Координаты x (-infinity,0) , y (0, infinity)")
elif n == 3:
    print("Координаты x (-infinity,0) , y (-infinity,0)")
elif n == 4:
    print("Координаты x (0,infinity) , y (-infinity,0)")
else: print("Такой четверти нет!")

# Напишите программу, которая принимает на вход координаты двух
# точек и находит расстояние между ними в 2D пространстве.

x1 = int(input('Введите число '))
y1 = int(input('Введите число '))
x2 = int(input('Введите число '))
y2 = int(input('Введите число '))

print(((x1 - x2)**2 + (y1-y2)**2)**0.5)

# Последовательностью Фибоначчи называется последовательность чисел.Требуется найти N-е число Фибоначчи.
n = int(input('Введите номер элемента ряда Фибонначи: '))

fib1 = fib2 = 1

print(fib1, fib2, end= ' ')
n= int(n)-2

i = 0
while i < n:
	fib1, fib2 = fib2, fib1 + fib2
	print(fib2, end=' ')
	i += 1

print(f"\nЗначение этого элемента - {fib2}")

