# 1. Напишите программу вычисления арифметического выражения заданного строкой.
# Используйте операции +,-,/,*. приоритет операций стандартный.

#     *Пример:*

#     2+2 => 4;

#     1+2*3 => 7;

#     1-2*3 => -5;

# n = input()
#
#
# sum = eval(n)
#
# print(sum)


# n = int(input())
# i = n
# while i > 0:
#     if n % 2**i == 0:
#         print(2**i)
#         break
#     i-=1
#



