from functools import reduce
from  random import  randint

# Пользователь вводит число, Вам необходимо вывести число Пи с той точностью знаков после запятой,
# сколько указал пользователь(БЕЗ ИСПОЛЬЗОВАНИЯ МОДУЛЕЙ/БИБЛИОТЕК)
# ___________________________________________________________________________________________________________________________________________

#Вариант №1
P = 62.8318530717
d = 20

pi = P/d

f = 6

print(round(pi, f))


# #Вариант №2
n = 10
f = 6
my_pi = sum(1/16**x*(4/(8*x + 1) - 2/(8*x + 4) - 1/(8*x + 5) - 1/(8*x + 6)) for x in range(n))
print(round(my_pi, f))
#
# # 3,1415926535897932384626433832795
#
#
# # ___________________________________________________________________________________________________________________________________________
# # Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# # ___________________________________________________________________________________________________________________________________________
#
#

def a(n):
    lst=[]
    for i in range(2, (n//2)+1):
        for j in lst:
            if i % j == 0:
                break
        else:
            lst.append(i)
    return lst

def mul(a, b):
    return a * b

flag = True
lst = []

n = 600
summ = n

d = a(n)
print(d)

while flag:
    if summ == 1:
        flag = False
    else:
        for i in d:
            if summ % i == 0:
                lst.append(i)
                summ /= i
                continue
print(lst)
print(reduce(mul,lst))

# ___________________________________________________________________________________________________________________________________________
# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов
# исходной последовательности.
# ___________________________________________________________________________________________________________________________________________

n = 10
init_lst = [randint(1,10) for i in range(n)]
print(init_lst)

def second_item(lst):
        if lst[1] == 1:
            return lst[1]

l = list(filter(second_item, [(init_lst[i], init_lst.count(init_lst[i])) for i in range(len(init_lst))]))

print([j[0] for j in l])




# ___________________________________________________________________________________________________________________________________________
# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100)
# многочлена и записать в файл многочлен степени k.

# Пример:

# - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
# ___________________________________________________________________________________________________________________________________________



k = int(input("Введите число: "))

while k >= 0:
     num = randint(0, 101)
     if num == 0 and k == 0: print(" = 0")
     elif num == 0:
         k -= 1
         continue
     if k == 0: print(f"{num} = 0")
     elif k == 1: print(f"{num}x + ", end = "")
     else: print(f"{num}x**{k} + ", end = "")
     k -= 1
